src/cf/InformationRegisters/НеоплаченныеСчетаОплатыСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НеоплаченныеСчетаОплатыСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ФактОплатыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФактОплатыЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемИПередачаВРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязьАбонентСервисаОрганизация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязьАбонентСервисаОрганизация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодАбонента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВзаимозачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСтроительныхРаботУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ведомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУКД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУПД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОбОшибкеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОператораЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеКАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетОферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПроизвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальноеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОплатаСервисаУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. ОплатаСервисаПереопределяемый.ПриУстановкеПредставленияВалютыОплаты
//
Процедура ПриУстановкеПредставленияВалютыОплаты(ПредставлениеВалютыОплаты) Экспорт
	
	ПредставлениеВалютыОплаты = НСтр("ru='руб.'");
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриПолученииИмениФормыОбработкиОтвета
//
Процедура ПриПолученииИмениФормыОбработкиОтвета(ИмяФормыОбработкиОтвета) Экспорт
	
	ИмяФормыОбработкиОтвета = "Обработка.ОплатаСервисаУНФ.Форма.ОбработкаОтвета";
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриОпределенииПоддержкиЗагрузкиТарифов
//
Процедура ПриОпределенииПоддержкиЗагрузкиТарифов(Результат) Экспорт
	
	Результат = Истина;
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриЗагрузкеТарифов
//
Процедура ПриЗагрузкеТарифов(ИсходныеДанные) Экспорт
	
	СоздатьНоменклатуруПоДаннымТарифовСервиса(ИсходныеДанные);
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриСозданииСчетаНаОплату
//
Процедура ПриСозданииСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки) Экспорт
	
	СчетНаОплатуСоздан = Ложь;
	Попытка
		СчетНаОплату = СоздатьСчетНаОплатуПоДаннымМенеджераСервиса(ДанныеЗапроса, РезультатОбработки);
		СчетНаОплатуСоздан = Истина;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
	Если Не СчетНаОплатуСоздан Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = НСтр("ru='Не удалось запросить счет на оплату на стороне обслуживающей организации.'");
	КонецЕсли;
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриПолученииПечатнойФормыСчетаНаОплату
//
Процедура ПриПолученииПечатнойФормыСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, ПечатнаяФорма, РезультатОбработки) экспорт
	
	ПечатнаяФормаПолучена = Ложь;
	Попытка
		ПечатнаяФорма = ПечатнаяФормаСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки);
		ПечатнаяФормаПолучена = Истина;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
	Если Не ПечатнаяФормаПолучена Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = НСтр("ru='Счет у обслуживающей организации заказан успешно, но получить печатную форму автоматически не удалось.
		|
		|Свяжитесь с обслуживающей организацией.'");
	КонецЕсли;
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриПолученииДанныхСчетаНаОплату
//
Процедура ПриПолученииДанныхСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, Данные, РезультатОбработки) Экспорт
	
	Если ТипЗнч(СчетНаОплату) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ПреобразованныеСчета = Документы.СчетНаОплату.СформироватьСчетаНаОплатуВXML(СчетНаОплату);
	Иначе
		ПреобразованныеСчета = Документы.ЗаказПокупателя.СформироватьСчетаНаОплатуВXML(СчетНаОплату);
	КонецЕсли;
	ПреобразованныйСчет = Неопределено;
	
	Для каждого ОписаниеСчета Из ПреобразованныеСчета Цикл
		Если ОписаниеСчета.Ссылка = СчетНаОплату Тогда
			ПреобразованныйСчет = ОписаниеСчета;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПреобразованныйСчет = Неопределено Или ЗначениеЗаполнено(ПреобразованныйСчет.ТекстОшибки) Тогда
		Если ПреобразованныйСчет = Неопределено Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,, СчетНаОплату, 
				НСтр("ru='Не найдены двоичные данные счета в результате метода Документы.СчетНаОплату.СформироватьСчетаНаОплатуВXML'"));
		Иначе
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,, СчетНаОплату, ПреобразованныйСчет.ТекстОшибки);
		КонецЕсли;
		
		// Внутри метода Документы.СчетНаОплату.СформироватьСчетаНаОплатуВXML
		// могут быть выданы сообщения пользователю о проблемах конвертации объекта в xml.
		СообщенияПользователю = ТекстСообщенийПользователю();
		Если ЗначениеЗаполнено(СообщенияПользователю) Тогда
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,, СчетНаОплату, СообщенияПользователю);
		КонецЕсли;
		
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = НСтр("ru='Счет у обслуживающей организации заказан успешно, но обменяться электронными документами автоматически не получилось.
		|
		|Свяжитесь с обслуживающей организацией.'");
		Возврат;
	КонецЕсли;
	
	Данные = ПолучитьИзВременногоХранилища(ПреобразованныйСчет.АдресВоВременномХранилище);
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриУстановкеНастроекОплатыСервиса
//
Процедура ПриУстановкеНастроекОплатыСервиса(КодАбонента, РезультатОбработки) Экспорт
	
	// Для установки настройки можно использовать параметр КодАбонента.
	// Он явно передается из абонента, под которым подключают биллинговую систему в МС.
	// Это не сделано, чтобы не менять существующую реализацию получения абонентов. 
	УстановитьНастройкиПоУмолчанию(); 

КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриУдаленииНастроекОплатыСервиса
//
Процедура ПриУдаленииНастроекОплатыСервиса(КодАбонента, РезультатОбработки) Экспорт
	
	УдалитьНастройки(РезультатОбработки);
	
КонецПроцедуры

// См. ОплатаСервисаПереопределяемый.ПриЗаполненииОбязательныхСведенийДляОформленияПодписки
//
Процедура ПриЗаполненииОбязательныхСведенийДляОформленияПодписки(ОбязательныеСведения, Абонент) Экспорт

	// Получим первую организацию из справочника "Организации"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Наименование КАК Наименование,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Отбор = УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации();
	
	ВидыДляОтбора = Новый Массив;
	ВидыДляОтбора.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	ВидыДляОтбора.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
	
	Отбор.ВидыКонтактнойИнформации = ВидыДляОтбора;
	Отбор.Дата = ТекущаяДатаСеанса();
	
	КонтактыПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(ТекущийПользователь, Отбор);
	
	ПочтаПользователя = "";
	ТелефонПользователя = "";
	
	Для Каждого Строка Из КонтактыПользователя Цикл
		Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя Тогда
			ПочтаПользователя = Строка.Представление;
		ИначеЕсли Строка.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя Тогда
			ТелефонПользователя = Строка.Представление;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеОрганизации = Результат.Выгрузить()[0]; 

	// Имена свойств актуальны только для 1cfresh.com, в других сервисах возможны другие имена свойств.
	Для Каждого Свойство Из ОбязательныеСведения.Свойства Цикл
		Если Свойство.Ключ = "НаименованиеОрганизации" И Не ЗначениеЗаполнено(Свойство.Значение) Тогда
			Свойство.Значение = ДанныеОрганизации.Наименование;
		ИначеЕсли Свойство.Ключ = "ИННАбонента" И Не ЗначениеЗаполнено(Свойство.Значение) Тогда
			// Для совместимости. В новых версиях технологии сервиса ИНН абонента содержится в коллекции "Реквизиты", ключ "public_id".
			Свойство.Значение = ДанныеОрганизации.ИНН;
		ИначеЕсли Свойство.Ключ = "КПП" И Не ЗначениеЗаполнено(Свойство.Значение) Тогда
			Свойство.Значение = ДанныеОрганизации.КПП;
		ИначеЕсли Свойство.Ключ = "КонтактноеЛицоАбонента" И Не ЗначениеЗаполнено(Свойство.Значение) Тогда
			Свойство.Значение = Строка(ТекущийПользователь);
		ИначеЕсли Свойство.Ключ = "ЭлектроннаяПочта" И Не ЗначениеЗаполнено(Свойство.Значение) Тогда
			Свойство.Значение = ПочтаПользователя;
		ИначеЕсли Свойство.Ключ = "Телефон" И Не ЗначениеЗаполнено(Свойство.Значение) Тогда
			Свойство.Значение = ТелефонПользователя;
		ИначеЕсли Свойство.Ключ = "НовыйКлиент1С" Тогда
			Свойство.Видимость = Ложь; // Скрытие реквизита с формы заполнения.
			Если Не ЗначениеЗаполнено(Свойство.Значение) Тогда
				Свойство.Значение = "Нет%"; // Заполнение невидимого на форме значения и типом Справочник.ЗначенияСвойствОбъектов.
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из ОбязательныеСведения.Реквизиты Цикл
		Если Реквизит.Ключ = "public_id" И Не ЗначениеЗаполнено(Реквизит.Значение) Тогда
			Реквизит.Значение = ДанныеОрганизации.ИНН;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбработкаСчетовНаОплатуСервиса.ИмяМетода);
	
КонецПроцедуры

#КонецОбласти

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	КомандаСоздатьНаОсновании.Менеджер = "ОбщийМодуль.ОплатаСервисаУНФ";
	КомандаСоздатьНаОсновании.Представление = НСтр("ru='Подписка на тариф'");
	КомандаСоздатьНаОсновании.РежимЗаписи = "Записывать";
	КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьАвтоматическоеВыставлениеСчетовДляОплатыСервиса";
	КомандаСоздатьНаОсновании.Обработчик = "ОплатаСервисаУНФКлиент.СоздатьПодпискуНаТарифНаОснованииСчетаНаОплату";
	КомандаСоздатьНаОсновании.Идентификатор = "ОплатаСервисаУНФСоздатьПодпискуНаТариф";
	Возврат КомандаСоздатьНаОсновании;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик подписки на событие ФактОплатыЗаказовПриЗаписиСчетаНаОплатуСервиса.
//
Процедура ФактОплатыЗаказовПриЗаписиСчетаНаОплатуСервисаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическоеВыставлениеСчетовДляОплатыСервиса") Тогда
		Возврат;
	КонецЕсли;
	
	СчетаНаОплату = Новый Массив;
	Для каждого Строка Из Источник Цикл
		СчетаНаОплату.Добавить(Строка.СчетНаОплату);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НеоплаченныеСчетаОплатыСервиса.СчетНаОплату КАК СчетНаОплату
	|ИЗ
	|	РегистрСведений.НеоплаченныеСчетаОплатыСервиса КАК НеоплаченныеСчетаОплатыСервиса
	|ГДЕ
	|	НеоплаченныеСчетаОплатыСервиса.СчетНаОплату В (&СчетаНаОплату)";
	Запрос.УстановитьПараметр("СчетаНаОплату", СчетаНаОплату);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьИспользованиеРегламентногоЗадания(Истина);
	
КонецПроцедуры

// Обработчик регламентного задания ОбработкаСчетовНаОплатуСервиса.
//
Процедура ОбработкаСчетовНаОплатуСервиса() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбработкаСчетовНаОплатуСервиса);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НеоплаченныеСчетаОплатыСервиса.СчетНаОплату КАК СчетНаОплату,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФактОплаты.Сумма, 0) = ЕСТЬNULL(ФактОплаты.СуммаОплаты, 0) + ЕСТЬNULL(ФактОплаты.СуммаАванса, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оплачен
	|ИЗ
	|	РегистрСведений.НеоплаченныеСчетаОплатыСервиса КАК НеоплаченныеСчетаОплатыСервиса
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФактОплатыЗаказов КАК ФактОплаты
	|		ПО НеоплаченныеСчетаОплатыСервиса.СчетНаОплату = ФактОплаты.СчетНаОплату";
	
	НаборЗаписейНеоплаченныеСчета = РегистрыСведений.НеоплаченныеСчетаОплатыСервиса.СоздатьНаборЗаписей();
	ОплаченныеСчета = Новый Массив;
	
	ИнформацияОбОплатеСчетов = Запрос.Выполнить().Выбрать();
	Пока ИнформацияОбОплатеСчетов.Следующий() Цикл
		Если ИнформацияОбОплатеСчетов.Оплачен = Истина Тогда
			ОплаченныеСчета.Добавить(ИнформацияОбОплатеСчетов.СчетНаОплату);
		Иначе
			НоваяЗапись = НаборЗаписейНеоплаченныеСчета.Добавить();
			НоваяЗапись.СчетНаОплату = ИнформацияОбОплатеСчетов.СчетНаОплату;
		КонецЕсли;
	КонецЦикла;
	
	Если ОплаченныеСчета.Количество() = 0 Тогда
		УстановитьИспользованиеРегламентногоЗадания(Ложь);
		Возврат;
	КонецЕсли;
	
	Для каждого СчетНаОплату Из ОплаченныеСчета Цикл
		ОтправитьПризнакОплатыСчета(СчетНаОплату, Истина);
	КонецЦикла;
	
	НаборЗаписейНеоплаченныеСчета.Записать(Истина);
	
	УстановитьИспользованиеРегламентногоЗадания(Ложь);
	
КонецПроцедуры

// Функция - Создать счет на оплату поставщика
//
// Параметры:
//  ДанныеСчетаНаОплатуСсылка - Строка - Ссылка на двоичные данные полученного счета на оплату.
//  РезультатОбработки - Структура:
//   * Ошибка - Булево - признак ошибки
//   * Сообщение - Строка - сообщение об ошибки
// 
// Возвращаемое значение:
//  ДокументСсылка.СчетНаОплатуПоставщика - созданный документ.
//
Функция СоздатьСчетНаОплатуПоставщика(ДанныеСчетаНаОплатуСсылка, РезультатОбработки) Экспорт
	
	СчетНаОплатуПоставщика = Неопределено;
	Попытка
		СчетНаОплатуПоставщика = СоздатьСчетНаОплатуОтОбслуживающейОрганизации(ДанныеСчетаНаОплатуСсылка, РезультатОбработки);
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;
	
	Если СчетНаОплатуПоставщика = Неопределено Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = НСтр("ru='Счет у обслуживающей организации заказан успешно, но создать счет на оплату (полученный) автоматически не получилось.
		|
		|Свяжитесь с обслуживающей организацией.'");
	КонецЕсли;
	
	Возврат СчетНаОплатуПоставщика;
	
КонецФункции

// Настройки оплаты читаются из безопасного хранилища, 
// т.к. нет возможности в неразделенном расширении добавить константы для хранения данных.
// Возвращаемое значение:
//  см. НовыйНастройкиОплатыСервиса
Функция НастройкиОплатыСервиса() Экспорт
	
	Настройки = НовыйНастройкиОплатыСервиса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	СохраненныеНастройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ВладелецНастроек(), КлючНастроекОплатыСервиса());
		
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Настройки, СохраненныеНастройки);
	КонецЕсли;                                                    
	
	Возврат Настройки;

КонецФункции 

// Настройки оплаты сохраняются в безопасном хранилище, 
// т.к. нет возможности в неразделенном расширении добавить константы для хранения данных.
Процедура СохранитьНастройкиОплатыСервиса(СохраняемыеНастройки) Экспорт
	
	Настройки = НовыйНастройкиОплатыСервиса();
	ЗаполнитьЗначенияСвойств(Настройки, СохраняемыеНастройки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		ВладелецНастроек(), Настройки, КлючНастроекОплатыСервиса());
	
КонецПроцедуры

Функция ИмяСобытияЖР() Экспорт
	
	Возврат НСтр("ru='Оплата сервиса'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция ДанныеСчетаДляОформленияПодписки(ДокументСчет) Экспорт
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("КодОО", 0);
	ДанныеСчета.Вставить("КодОбслуживаемогоАбонента", 0);
	ДанныеСчета.Вставить("ДатаПодключения", НачалоДня(ТекущаяДатаСеанса()));
	ДанныеСчета.Вставить("ТекстОшибки", "");
	
	СвойстваОтвета = ПрограммныйИнтерфейсСервиса.НовыйОсновныеСвойстваОтвета();
	
	Попытка
		ДанныеСчетаМС = ПрограммныйИнтерфейсСервиса.ДанныеСчетаНаОплату(ДокументСчет.УникальныйИдентификатор(), , , СвойстваОтвета);
	Исключение
		Если СвойстваОтвета.КодОтвета = 10404 Тогда
			ДанныеСчета.ТекстОшибки = НСтр("ru = 'В Менеджере сервиса отсутствует счет на оплату, соответствующий текущему счету.'");
		Иначе
			ДанныеСчета.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецЕсли;
		Возврат ДанныеСчета;
	КонецПопытки;
	
	Если ДанныеСчетаМС.Тарифы.Количество() = 0 Тогда
		ДанныеСчета.ТекстОшибки = НСтр("ru = 'Счет на оплату не содержит тарифов сервиса для оформления подписки.'");
		Возврат ДанныеСчета;
	КонецЕсли;
	
	Если ТипЗнч(ДокументСчет) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ДанныеСчета.ДатаПодключения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСчет, "ДатаОтгрузки");
	КонецЕсли;
	ДанныеСчета.КодОО = ДанныеСчетаМС.КодПродавца;
	ДанныеСчета.КодОбслуживаемогоАбонента = ДанныеСчетаМС.КодПокупателя;
	Возврат ДанныеСчета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Реализация метода отправки признака оплаты счета в менеджер сервиса.
// 
// Параметры:
//  СчетНаОплату - ДокументСсылка.СчетНаОплату
//  Оплачен - Булево - признак оплаты счета.
// 
// Возвращаемое значение:
//  HTTPОтвет - ответ менеджера сервиса.
//
Функция ОтправитьПризнакОплатыСчета(СчетНаОплату, Оплачен)
	
	Данные = ОплатаСервиса.ШаблонДанныхОтвета();
	Данные.Вставить("paid", Оплачен);
	ИдентификаторСчета = СчетНаОплату.УникальныйИдентификатор();
	Результат = ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
	
	Если ТипЗнч(Результат) = Тип("HTTPСервисОтвет") Тогда
		КодСостояния = СтрШаблон("%1 %2", Результат.КодСостояния, Результат.Причина);
	Иначе
		КодСостояния = Результат.КодСостояния
	КонецЕсли;
	Комментарий = СтрШаблон(НСтр("ru='ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга()
		|Код состояния: %1
		|Тело ответа: %2'"),
		КодСостояния,
		Результат.ПолучитьТелоКакСтроку());
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Информация,,, Комментарий);
	
	Возврат Результат;
	
КонецФункции

// Новый настройки оплаты сервиса.
// 
// Возвращаемое значение:
//  Структура:
//   * ГруппаНоменклатурыТарифовСервиса - СправочникСсылка.Номенклатура
//   * ОформляемыйДокумент - Строка
//   * ВидЗаказа - СправочникСсылка.ВидыЗаказовПокупателей
//   * СостояниеЗаказа - СправочникСсылка.СостоянияЗаказовПокупателей
//   * ОтправляемаяПечатнаяФорма - Строка
Функция НовыйНастройкиОплатыСервиса()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ГруппаНоменклатурыТарифовСервиса", Справочники.Номенклатура.ПустаяСсылка());
	Настройки.Вставить("ОформляемыйДокумент", "СчетНаОплату");   
	Настройки.Вставить("ВидЗаказа", Справочники.ВидыЗаказовПокупателей.Основной);
	Настройки.Вставить("СостояниеЗаказа", Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка());
	Настройки.Вставить("ОтправляемаяПечатнаяФорма", "");
	
	Возврат Настройки;
	
КонецФункции

Процедура УстановитьНастройкиПоУмолчанию()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ИспользоватьАвтоматическоеВыставлениеСчетовДляОплатыСервиса.Установить(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации";
	Организации = Запрос.Выполнить().Выгрузить();
	
	Если Организации.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеАбоненты = ПрограммныйИнтерфейсСервиса.Абоненты();
	Если ДоступныеАбоненты.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	СвязьОрганизацияАбонент = РегистрыСведений.СвязьАбонентСервисаОрганизация.СоздатьНаборЗаписей();
	НоваяСтрока = СвязьОрганизацияАбонент.Добавить();
	НоваяСтрока.КодАбонента = ДоступныеАбоненты[0].Код;
	НоваяСтрока.Организация = Организации[0].Ссылка;
	СвязьОрганизацияАбонент.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьНастройки(РезультатОбработки)
	
	// Снятие признака использования выставления счетов.
	УстановитьПривилегированныйРежим(Истина);
	
	// Можно переделать механизм на использование поставляемой константы и ФО "ИспользоватьОплатуСервиса".
	Константы.ИспользоватьАвтоматическоеВыставлениеСчетовДляОплатыСервиса.Установить(Ложь);

	// Очистка связей абонентов и организаций.
	СвязьОрганизацияАбонент = РегистрыСведений.СвязьАбонентСервисаОрганизация.СоздатьНаборЗаписей();
	СвязьОрганизацияАбонент.Записать(Истина);
	
КонецПроцедуры

Функция ВладелецНастроек()
	
	Возврат "ОплатаСервисаУНФ";
	
КонецФункции 

Функция КлючНастроекОплатыСервиса()
	
	Возврат "НастройкиОплатыСервиса";
	
КонецФункции

Функция АртикулХарактеристики(Префикс, КодТарифа, КодПериодаДействия)
	
	Возврат Префикс + СтрСоединить(СтрРазделить(СокрЛП(КодТарифа), " ", Ложь), "-") + "-" + КодПериодаДействия;
	
КонецФункции 

Функция НайтиСоздатьХарактеристикуПоНаименованию(Наименование, Владелец)
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(Наименование,,, Владелец);
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		ХарактеристикаОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		ХарактеристикаОбъект.Наименование = Наименование;
		ХарактеристикаОбъект.НаименованиеДляПечати = Наименование;
		ХарактеристикаОбъект.Владелец = Владелец;
		ХарактеристикаОбъект.Записать();
		Характеристика = ХарактеристикаОбъект.Ссылка;
	КонецЕсли;                          
	
	Возврат Характеристика;
	
КонецФункции

Функция НайтиСоздатьНоменклатуруПоНаименованию(Наименование, ВидСтавкиНДС, ИспользоватьХарактеристики = Ложь)
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Наименование", Наименование);
	ДанныеЗаполнения.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга);
	ДанныеЗаполнения.Вставить("ЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.шт);
	ДанныеЗаполнения.Вставить("КатегорияНоменклатуры", Справочники.КатегорииНоменклатуры.БезКатегории);
	ДанныеЗаполнения.Вставить("ИспользоватьХарактеристики", ИспользоватьХарактеристики);
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Номенклатура, ДанныеЗаполнения);
	Номенклатура.Заполнить(ДанныеЗаполнения);
	Номенклатура.НаименованиеПолное = Номенклатура.Наименование;
	Номенклатура.СчетУчетаЗапасов = ПланыСчетов.Управленческий.СырьеИМатериалы;
	Номенклатура.СчетУчетаЗатрат = ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Номенклатура.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	Номенклатура.ВидСтавкиНДС = ВидСтавкиНДС;
	Номенклатура.Записать();
	
	Возврат Номенклатура.Ссылка;
	
КонецФункции

Функция ДатаОтгрузкиПоЗавершениюПодписок(КодОО, КодАбонента)
	
	ДатаОтгрузки = ТекущаяДатаСеанса();
	
	Отбор = ПрограммныйИнтерфейсСервиса.НовыйОтборПодписокНаТарифы();
	Отбор.КодОбслуживаемогоАбонента = КодАбонента;
	Отбор.ТолькоАктивные = Истина;
	Отбор.ТолькоОсновные = Истина;
	
	ПодпискиАбонента = ПрограммныйИнтерфейсСервиса.ПодпискиНаТарифы(Отбор, КодОО);
	Если ПодпискиАбонента.Количество() > 0 Тогда
		ПодпискиАбонента.Сортировать("ДатаОтключения УБЫВ");
		ДатаОтгрузки = КонецДня(ПодпискиАбонента[0].ДатаОтключения) + 1;
	КонецЕсли;                                                          
	
	Возврат ДатаОтгрузки;
	
КонецФункции

Процедура СоздатьНоменклатуруПоДаннымТарифовСервиса(ИсходныеДанные)
	
	Настройки = НастройкиОплатыСервиса();
	ГруппаНоменклатуры = Настройки.ГруппаНоменклатурыТарифовСервиса;
	Если Не ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьГруппу();
		Номенклатура.Наименование = НСтр("ru = 'Тарифы сервиса'");
		Номенклатура.Записать(); 
		ГруппаНоменклатуры = Номенклатура.Ссылка;
		Настройки.ГруппаНоменклатурыТарифовСервиса = ГруппаНоменклатуры;
		СохранитьНастройкиОплатыСервиса(Настройки);
	КонецЕсли;
	
	// Используются характеристики для добавления периодов тарифов
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Константы.ФункциональнаяОпцияИспользоватьХарактеристики.Установить(Истина);
	КонецЕсли;

	ДанныеЗаполнения = Новый ТаблицаЗначений;
	ДанныеЗаполнения.Колонки.Добавить("АртикулНоменклатуры", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеЗаполнения.Колонки.Добавить("НаименованиеНоменклатуры", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ДанныеЗаполнения.Колонки.Добавить("АртикулХарактеристики", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеЗаполнения.Колонки.Добавить("НаименованиеХарактеристики", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ДанныеЗаполнения.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаСтрока(9));
	
	ДобавитьСтрокиПоТарифам(ДанныеЗаполнения, ИсходныеДанные.ТарифыПровайдера, ПрефиксТарифаПровайдера());
	ДобавитьСтрокиПоТарифам(ДанныеЗаполнения, ИсходныеДанные.ТарифыОбслуживающейОрганизации, ПрефиксТарифаОбслуживающейОрганизации());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсходныеДанные.АртикулНоменклатуры КАК АртикулНоменклатуры,
		|	ИсходныеДанные.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
		|	ИсходныеДанные.АртикулХарактеристики КАК АртикулХарактеристики,
		|	ИсходныеДанные.НаименованиеХарактеристики КАК НаименованиеХарактеристики
		|ПОМЕСТИТЬ ИсходныеДанные
		|ИЗ
		|	&ИсходныеДанные КАК ИсходныеДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.АртикулНоменклатуры КАК АртикулНоменклатуры,
		|	ИсходныеДанные.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
		|	ИсходныеДанные.АртикулХарактеристики КАК АртикулХарактеристики,
		|	ИсходныеДанные.НаименованиеХарактеристики КАК НаименованиеХарактеристики,
		|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
		|ИЗ
		|	ИсходныеДанные КАК ИсходныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО (Номенклатура.Артикул = ИсходныеДанные.АртикулНоменклатуры)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО (ХарактеристикиНоменклатуры.Артикул = ИсходныеДанные.АртикулХарактеристики)
		|ИТОГИ
		|	МАКСИМУМ(НаименованиеНоменклатуры),
		|	МАКСИМУМ(Номенклатура)
		|ПО
		|	АртикулНоменклатуры";
	
	Запрос.УстановитьПараметр("ИсходныеДанные", ДанныеЗаполнения);
	
	ОрганизацияПоУмолчанию = Справочники.Организации.ОрганизацияПоУмолчанию();
	ВидСтавкиНДСПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияПоУмолчанию, "ВидСтавкиНДСПоУмолчанию");
	
	Результат = Запрос.Выполнить();
	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		Номенклатура = ВыборкаНоменклатура.Номенклатура;
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Наименование", ВыборкаНоменклатура.НаименованиеНоменклатуры);
			ДанныеЗаполнения.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга);
			ДанныеЗаполнения.Вставить("ЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.шт);
			ДанныеЗаполнения.Вставить("КатегорияНоменклатуры", Справочники.КатегорииНоменклатуры.БезКатегории);
			ДанныеЗаполнения.Вставить("Артикул", ВыборкаНоменклатура.АртикулНоменклатуры);
			ДанныеЗаполнения.Вставить("Родитель", ГруппаНоменклатуры); 
			ДанныеЗаполнения.Вставить("ИспользоватьХарактеристики", Истина);
			ДанныеЗаполнения.Вставить("ПроверятьЗаполнениеХарактеристики", Истина);
			
			НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НоменклатураОбъект, ДанныеЗаполнения);
			НоменклатураОбъект.Заполнить(ДанныеЗаполнения);
			НоменклатураОбъект.НаименованиеПолное = НоменклатураОбъект.Наименование;
			НоменклатураОбъект.СчетУчетаЗапасов = ПланыСчетов.Управленческий.СырьеИМатериалы;
			НоменклатураОбъект.СчетУчетаЗатрат = ПланыСчетов.Управленческий.НезавершенноеПроизводство;
			НоменклатураОбъект.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
			НоменклатураОбъект.ВидСтавкиНДС = ВидСтавкиНДСПоУмолчанию;
			НоменклатураОбъект.Записать();
			
			Номенклатура = НоменклатураОбъект.Ссылка;

		КонецЕсли;
		
		ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаХарактеристики.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаХарактеристики.Характеристика) Тогда
				Продолжить;
			КонецЕсли;     
			
			ХарактеристикаОбъект = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
			ХарактеристикаОбъект.Владелец = Номенклатура;
			ХарактеристикаОбъект.Наименование = ВыборкаХарактеристики.НаименованиеХарактеристики;
			ХарактеристикаОбъект.Артикул = ВыборкаХарактеристики.АртикулХарактеристики;
			ХарактеристикаОбъект.НаименованиеДляПечати = ВыборкаХарактеристики.НаименованиеХарактеристики;
			ХарактеристикаОбъект.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РазыменоватьДанныеСчетаНаОплатуПоДаннымМенеджераСервиса(ДанныеЗапроса, РезультатОбработки)
	
	ДатаОтгрузки = ДатаОтгрузкиПоЗавершениюПодписок(ДанныеЗапроса.КодПродавца, ДанныеЗапроса.КодПокупателя);
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("Контрагент");
	ДанныеСчета.Вставить("Организация");
	ДанныеСчета.Вставить("Номенклатура", Новый Массив);
	ДанныеСчета.Вставить("ДатаОтгрузки", ДатаОтгрузки);
	
	ДанныеСчета.Организация = ОрганизацияПоКодуАбонента(ДанныеЗапроса.КодПродавца);
	Если Не ЗначениеЗаполнено(ДанныеСчета.Организация) Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = СтрШаблон(НСтр("ru = 'Не удалось создать счет на оплату на стороне обслуживающей организации.
		|Не найдена настройка организации для кода абонента - %1.
		|
		|Свяжитесь с обслуживающей организацией.'"), ДанныеЗапроса.КодПродавца);
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, РезультатОбработки.Сообщение);
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеСчета.Контрагент = НайтиСоздатьКонтрагента(ДанныеЗапроса.ПубличныйИдентификаторПокупателя, ДанныеЗапроса.НаименованиеПокупателя);
	
	Для Каждого Строка Из ДанныеЗапроса.Тарифы Цикл
		
		Если ЗначениеЗаполнено(Строка.КодТарифаОбслуживающейОрганизации) Тогда
			Префикс = ПрефиксТарифаОбслуживающейОрганизации();
			КодТарифа = Строка.КодТарифаОбслуживающейОрганизации;
		Иначе
			Префикс = ПрефиксТарифаПровайдера();
			КодТарифа = Строка.КодТарифаПровайдера;
		КонецЕсли;
		Артикул = АртикулНоменклатуры(Префикс, КодТарифа, Строка.КодПериодаДействия);
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			РезультатОбработки.Ошибка = Истина;
			РезультатОбработки.Сообщение = СтрШаблон(НСтр("ru = 'Не удалось создать счет на оплату на стороне обслуживающей организации.
			|Не найдена подходящая номенклатура для описания тарифа. Артикул %1.
			|
			|Свяжитесь с обслуживающей организацией.'"), Артикул);
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, РезультатОбработки.Сообщение);
			Возврат Неопределено;
		КонецЕсли;
		АртикулХарактеристики = АртикулХарактеристики(Префикс, КодТарифа, Строка.КодПериодаДействия);
		Характеристика = Справочники.ХарактеристикиНоменклатуры.НайтиПоРеквизиту("Артикул", АртикулХарактеристики, , Номенклатура);
		Если Не ЗначениеЗаполнено(Характеристика) Тогда
			РезультатОбработки.Ошибка = Истина;
			РезультатОбработки.Сообщение = СтрШаблон(НСтр("ru = 'Не удалось создать счет на оплату на стороне обслуживающей организации.
			|Не найдена подходящая характеристика номенклатуры для описания тарифа. Артикул %1.
			|
			|Свяжитесь с обслуживающей организацией.'"), АртикулХарактеристики);
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, РезультатОбработки.Сообщение);
			Возврат Неопределено;
		КонецЕсли;
		
		ДанныеНоменклатуры = Новый Структура;
		ДанныеНоменклатуры.Вставить("Номенклатура", Номенклатура);
		ДанныеНоменклатуры.Вставить("Характеристика", Характеристика);
		ДанныеНоменклатуры.Вставить("Количество", Строка.Количество);
		ДанныеНоменклатуры.Вставить("Сумма", Строка.Сумма);
		
		ДанныеСчета.Номенклатура.Добавить(ДанныеНоменклатуры);
	КонецЦикла;
	
	// Обработка табличной части услуг
	ВидСтавкиНДСПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСчета.Организация, "ВидСтавкиНДСПоУмолчанию");
	
	Для Каждого Строка Из ДанныеЗапроса.Услуги Цикл
		Номенклатура = НайтиСоздатьУслугуПоНаименованию(Строка.Услуга, ВидСтавкиНДСПоУмолчанию);
		ДанныеНоменклатуры = Новый Структура;
		ДанныеНоменклатуры.Вставить("Номенклатура", Номенклатура);
		ДанныеНоменклатуры.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		ДанныеНоменклатуры.Вставить("Количество", 1);
		ДанныеНоменклатуры.Вставить("Сумма", Строка.Сумма);
		ДанныеСчета.Номенклатура.Добавить(ДанныеНоменклатуры);
	КонецЦикла;
	
	Возврат ДанныеСчета;
	
КонецФункции

Функция СоздатьСчетНаОплатуПоДаннымМенеджераСервиса(ДанныеЗапроса, РезультатОбработки)
	
	ДанныеСчета = РазыменоватьДанныеСчетаНаОплатуПоДаннымМенеджераСервиса(ДанныеЗапроса, РезультатОбработки);
	Если РезультатОбработки.Ошибка Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройки = НастройкиОплатыСервиса();
	ОформляемыйДокумент = Настройки.ОформляемыйДокумент;

	СчетЗаказСсылка = Документы[ОформляемыйДокумент].ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеЗапроса.ИдентификаторСчета));
	Если Не ОбщегоНазначения.СсылкаСуществует(СчетЗаказСсылка) Тогда
		СчетЗаказ = Документы[ОформляемыйДокумент].СоздатьДокумент();
		СчетЗаказ.УстановитьСсылкуНового(СчетЗаказСсылка);
		СчетЗаказ.Дата = ТекущаяДатаСеанса();
		СчетЗаказ.УстановитьНовыйНомер();
		СчетЗаказ.Заполнить(Неопределено);
	Иначе
		СчетЗаказ = СчетЗаказСсылка.ПолучитьОбъект();
	КонецЕсли;

	СчетЗаказ.Организация = ДанныеСчета.Организация;
	СчетЗаказ.Контрагент = ДанныеСчета.Контрагент;
	СчетЗаказ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(ДанныеСчета.Контрагент);
	
	Если ОформляемыйДокумент = "ЗаказПокупателя" Тогда
		СчетЗаказ.ВидЗаказа = Настройки.ВидЗаказа;
		СчетЗаказ.СостояниеЗаказа = Настройки.СостояниеЗаказа;
		СчетЗаказ.ДатаОтгрузки = ДанныеСчета.ДатаОтгрузки;
		СчетЗаказ.ВидЭлектронногоДокумента = Перечисления.ТипыДокументовЭДО.СчетНаОплату;
	КонецЕсли;

	СчетЗаказ.Запасы.Очистить();
	Для Каждого СтрокаДанныеНоменклатуры Из ДанныеСчета.Номенклатура Цикл
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДанныеНоменклатуры.Номенклатура,
		"ЕдиницаИзмерения,ВидСтавкиНДС");

		НоваяСтрока = СчетЗаказ.Запасы.Добавить();
		НоваяСтрока.Номенклатура = СтрокаДанныеНоменклатуры.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаДанныеНоменклатуры.Характеристика;
		НоваяСтрока.Содержание = ТабличныеЧастиУНФ.ТекстСодержания(НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика);
		НоваяСтрока.Количество = СтрокаДанныеНоменклатуры.Количество;
		НоваяСтрока.Сумма = СтрокаДанныеНоменклатуры.Сумма;
		НоваяСтрока.Цена = СтрокаДанныеНоменклатуры.Сумма / СтрокаДанныеНоменклатуры.Количество;
		НоваяСтрока.ЕдиницаИзмерения = ДанныеНоменклатуры.ЕдиницаИзмерения;
		НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ДанныеНоменклатуры.ВидСтавкиНДС);
		СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
		Если СчетЗаказ.СуммаВключаетНДС Тогда
			НоваяСтрока.СуммаНДС = НоваяСтрока.Сумма - (НоваяСтрока.Сумма) / ((СтавкаНДС + 100) / 100);
			НоваяСтрока.Всего = НоваяСтрока.Сумма;
		Иначе
			НоваяСтрока.СуммаНДС = НоваяСтрока.Сумма * СтавкаНДС / 100;
			НоваяСтрока.Всего = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	СчетЗаказ.СуммаДокумента = СчетЗаказ.Запасы.Итог("Всего");
	СчетЗаказ.Комментарий = СтрШаблон(
		НСтр("ru='#Создан автоматически. Выставление счета на оплату сервиса.
				 |Код абонента %1
				 |Дата отгрузки по завершению подписок %2'"), 
		ДанныеЗапроса.КодПокупателя, 
		Формат(ДанныеСчета.ДатаОтгрузки, "ДЛФ=D"));
		
	СчетНаОплатуЗаписан = Ложь;
	
	Попытка
		СчетЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		СчетНаОплатуЗаписан = Истина;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;

	Если Не СчетНаОплатуЗаписан Тогда
		СчетЗаказ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

	СчетЗаказСсылка = СчетЗаказ.Ссылка;
	
	Если ТипЗнч(СчетЗаказСсылка) = Тип("ДокументСсылка.ЗаказПокупателя")
		Или ТипЗнч(СчетЗаказСсылка) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ЗаписьНеоплаченныйСчет = РегистрыСведений.НеоплаченныеСчетаОплатыСервиса.СоздатьМенеджерЗаписи();
		ЗаписьНеоплаченныйСчет.СчетНаОплату = СчетЗаказСсылка;
		ЗаписьНеоплаченныйСчет.Записать(Истина);
	КонецЕсли;

	Возврат СчетЗаказСсылка;
	 
КонецФункции

Функция СоздатьСчетНаОплатуОтОбслуживающейОрганизации(ДанныеСчетаНаОплатуСсылка, РезультатОбработки)
	
	ДанныеДокументов = Документы.СчетНаОплату.РазобратьСчетаНаОплатуПокупателюXML(ДанныеСчетаНаОплатуСсылка);
	
	Если ДанныеДокументов.Количество() = 0 Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = СтрШаблон(НСтр("ru='Не удалось создать счет на оплату (полученный) на основании полученных данных электронного документа.
		|
		|%1'"), ТекстСообщенийПользователю());
		Возврат Документы.СчетНаОплатуПоставщика.ПустаяСсылка();
	КонецЕсли;
	
	ДанныеСчета = ДанныеДокументов[0].ДанныеСчета;
	
	СуммаДокумента = ДанныеСчета.ШапкаДокумента.СуммаДокумента;
	
	Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", ДанныеСчета.ШапкаДокумента.ИННОрганизации);
	Если Не ЗначениеЗаполнено(Организация) Тогда
		РезультатОбработки.Ошибка = Истина;  
		РезультатОбработки.Сообщение = СтрШаблон(НСтр("ru='Не удалось создать счет на оплату (полученный) по причине:
		|Не найдена организация по ИНН: %1
		|Проверьте данные организации в справочнике.'"), ДанныеСчета.ШапкаДокумента.ИННОрганизации);
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
			РезультатОбработки.ФорматированноеСообщение = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'См. справочник <a href=""%1"">Организации</a>'"), "e1cib/list/Справочник.Организации");
		Иначе
			РезультатОбработки.ФорматированноеСообщение = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'См. <a href=""%1"">реквизиты организации</a>'"), 
				ПолучитьНавигационнуюСсылку(Справочники.Организации.ОрганизацияПоУмолчанию()));
		КонецЕсли;
		Возврат Документы.СчетНаОплатуПоставщика.ПустаяСсылка();
	КонецЕсли;

	ДанныеЗаполненияКонтрагента = ДанныеСчета.РеквизитыКонтрагента;
	ДанныеЗаполненияКонтрагента.Вставить("Покупатель", Истина);
	Контрагент = Справочники.Контрагенты.СоздатьКонтрагента(ДанныеЗаполненияКонтрагента);
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = НСтр("ru='Не удалось создать счет на оплату (полученный) по причине:
		|Не удалось найти или создать обслуживающую организацию в справочнике контрагентов по реквизитам.'");
		Возврат Документы.СчетНаОплатуПоставщика.ПустаяСсылка();
	КонецЕсли;
	ДанныеКонтрагента = ДанныеКонтрагента(Контрагент);

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Организация);
	ДанныеЗаполнения.Вставить("Дата", ДанныеСчета.ШапкаДокумента.Дата);
	ДанныеЗаполнения.Вставить("ДатаВходящегоДокумента", ДанныеСчета.ШапкаДокумента.Дата);
	ДанныеЗаполнения.Вставить("НомерВходящегоДокумента", ДанныеСчета.ШапкаДокумента.Номер);
	ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
	ДанныеЗаполнения.Вставить("БанковскийСчет", ДанныеКонтрагента.БанковскийСчетПоУмолчанию);
	Если Не ДанныеКонтрагента.ВестиРасчетыПоДоговорам Тогда
		ДанныеЗаполнения.Вставить("Договор", Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент));
	Иначе
		МенеджерСправочника = Справочники.ДоговорыКонтрагентов;
		СписокВидовДоговоров = МенеджерСправочника.ПолучитьСписокВидовДоговораДляДокумента(Документы.СчетНаОплатуПоставщика.ПустаяСсылка());
		ДоговорПоУмолчанию = МенеджерСправочника.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговоров);
		ДанныеЗаполнения.Вставить("Договор", ДоговорПоУмолчанию);
	КонецЕсли;
	ДанныеЗаполнения.Вставить("ВалютаДокумента", ДанныеКонтрагента.БанковскийСчетПоУмолчаниюВалютаДенежныхСредств);
	ДанныеЗаполнения.Вставить("СуммаВключаетНДС", ДанныеСчета.ШапкаДокумента.ЦенаВключаетНДС);
	
	ВидСтавкиНДСПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВидСтавкиНДСПоУмолчанию");

	СчетНаОплатуПоставщика = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(СчетНаОплатуПоставщика, ДанныеЗаполнения);
	СчетНаОплатуПоставщика.Заполнить(ДанныеЗаполнения);
	СчетНаОплатуПоставщика.Комментарий = НСтр("ru='#Создан автоматически. Выставление счета на оплату сервиса.'");
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	
	Для каждого Товар Из ДанныеСчета.Товары Цикл

		Если ЗначениеЗаполнено(Товар.СтавкаНДС) Тогда
			ВидСтавкиНДС = Товар.СтавкаНДС.ВидСтавкиНДС;
		Иначе
			ВидСтавкиНДС = ВидСтавкиНДСПоУмолчанию;
		КонецЕсли;

		НоваяСтрока = СчетНаОплатуПоставщика.Запасы.Добавить();
		Если ИспользоватьХарактеристики И ЗначениеЗаполнено(Товар.Характеристика) Тогда
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатуруПоНаименованию(Товар.Наименование, ВидСтавкиНДС, ИспользоватьХарактеристики);
			НоваяСтрока.Характеристика = НайтиСоздатьХарактеристикуПоНаименованию(Товар.Характеристика, НоваяСтрока.Номенклатура); 
		Иначе
			НаименованиеНоменклатуры = Товар.Наименование;
			Если ЗначениеЗаполнено(Товар.Характеристика) Тогда
				НаименованиеНоменклатуры = СтрШаблон("%1 (%2)", Товар.Наименование, Товар.Характеристика);
			КонецЕсли;
			НоваяСтрока.Номенклатура = НайтиСоздатьНоменклатуруПоНаименованию(НаименованиеНоменклатуры, ВидСтавкиНДС, ИспользоватьХарактеристики);
		КонецЕсли;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.Количество = Товар.Количество;
		НоваяСтрока.Цена       = Товар.Цена;
		НоваяСтрока.Сумма      = Товар.Сумма;
		НоваяСтрока.СуммаНДС   = Товар.СуммаНДС;
		НоваяСтрока.СтавкаНДС  = Товар.СтавкаНДС;
		Если ДанныеСчета.ШапкаДокумента.ЦенаВключаетНДС Тогда
			НоваяСтрока.Всего = НоваяСтрока.Сумма;
		Иначе
			НоваяСтрока.Всего = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
		КонецЕсли;
	КонецЦикла;

	Если СчетНаОплатуПоставщика.Запасы.Итог("СуммаНДС") > 0 Тогда
		СчетНаОплатуПоставщика.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Иначе
		СчетНаОплатуПоставщика.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	КонецЕсли;

	СчетНаОплатуПоставщикаЗаписан = Ложь;
	ТекстОшибки = "";
	Попытка
		СчетНаОплатуПоставщика.Записать(РежимЗаписиДокумента.Проведение);
		СчетНаОплатуПоставщикаЗаписан = Истина;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
	КонецПопытки;

	Если Не СчетНаОплатуПоставщикаЗаписан Тогда
		Попытка
			СчетНаОплатуПоставщика.Записать(РежимЗаписиДокумента.Запись);
			СчетНаОплатуПоставщикаЗаписан = Истина;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР(), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки;
	КонецЕсли;

	Если Не СчетНаОплатуПоставщикаЗаписан Тогда
		РезультатОбработки.Ошибка = Истина;
		РезультатОбработки.Сообщение = СтрШаблон(НСтр("ru='Не удалось создать счет на оплату поставщика.
		|
		|%1'"), ТекстОшибки);
		Возврат Документы.СчетНаОплатуПоставщика.ПустаяСсылка();
	КонецЕсли;

	Возврат СчетНаОплатуПоставщика.Ссылка;
	
КонецФункции

Функция ПечатнаяФормаСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки)
	
	Настройки = НастройкиОплатыСервиса();
	ИдентификаторПФ = Настройки.ОтправляемаяПечатнаяФорма;
	Если Не ЗначениеЗаполнено(ИдентификаторПФ) Тогда
		ИдентификаторПФ = "СчетНаОплату";
	КонецЕсли;
	КомандыПечатиЗаказа = УправлениеПечатью.КомандыПечатиФормы(
		СтрШаблон("Документ.%1.Форма.ФормаСписка", Настройки.ОформляемыйДокумент));
	ВыбраннаяКомандаПечати = КомандыПечатиЗаказа.Найти(ИдентификаторПФ, "Идентификатор");
	ВыбранныеКомандыПечати = Новый Массив;
	Если ВыбраннаяКомандаПечати <> Неопределено Тогда
		ВыбранныеКомандыПечати.Добавить(ВыбраннаяКомандаПечати);
	КонецЕсли;

	НастройкиСохранения = УправлениеПечатью.НастройкиСохранения();
	НастройкиСохранения.ФорматыСохранения.Очистить();
	НастройкиСохранения.ФорматыСохранения.Добавить(ТипФайлаТабличногоДокумента.MXL);

	РезультатПечати = УправлениеПечатью.НапечататьВФайл(
		ВыбранныеКомандыПечати, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СчетНаОплату), НастройкиСохранения);
	Если РезультатПечати.Количество() <> 0 Тогда
		ПечатнаяФорма = РезультатПечати[0].ДвоичныеДанные;
	Иначе
		ПечатнаяФорма = Неопределено;
	КонецЕсли;

	Если ПечатнаяФорма = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Поток = ПечатнаяФорма.ОткрытьПотокДляЧтения();
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(Поток);
	Поток.Закрыть();

	Возврат ТабличныйДокумент;

КонецФункции

Функция ПрефиксТарифаПровайдера()
	
	Возврат "PR-";
	
КонецФункции

Функция ПрефиксТарифаОбслуживающейОрганизации()
	
	Возврат "SC-";
	
КонецФункции

Функция АртикулНоменклатуры(Префикс, КодТарифа, КодПериодаДействия)
	
	Возврат Префикс + СтрСоединить(СтрРазделить(СокрЛП(КодТарифа), " ", Ложь), "-");
	
КонецФункции

Процедура ДобавитьСтрокиПоТарифам(ДанныеЗаполнения, Тарифы, Префикс)
	
	Для Каждого Тариф Из Тарифы Цикл
		Для Каждого Период Из Тариф.ПериодыДействия Цикл
			НоваяСтрока = ДанныеЗаполнения.Добавить();
			НоваяСтрока.АртикулНоменклатуры = АртикулНоменклатуры(Префикс, Тариф.Код, Период.Код);
			НоваяСтрока.НаименованиеНоменклатуры = Тариф.Наименование;
			НоваяСтрока.АртикулХарактеристики = АртикулХарактеристики(Префикс, Тариф.Код, Период.Код);
			НоваяСтрока.НаименованиеХарактеристики = Период.Наименование;
			НоваяСтрока.Цена = Период.Сумма;
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры

Функция ОрганизацияПоКодуАбонента(КодАбонента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвязьАбонентСервисаОрганизация.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.СвязьАбонентСервисаОрганизация КАК СвязьАбонентСервисаОрганизация
	|ГДЕ
	|	СвязьАбонентСервисаОрганизация.КодАбонента = &КодАбонента";
	Запрос.УстановитьПараметр("КодАбонента", КодАбонента);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Организация = Результат.Организация;
	Иначе
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

Функция НайтиСоздатьКонтрагента(ИНН, Наименование)
	
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Контрагент;
	КонецЕсли;
	
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.ИНН = ИНН;
	КонтрагентОбъект.Наименование = Наименование;
	КонтрагентОбъект.Заполнить(Неопределено);
	КонтрагентОбъект.ЗаполнитьПоИНН();
	КонтрагентОбъект.Покупатель = Истина;
	КонтрагентОбъект.Записать();
	
	Возврат КонтрагентОбъект.Ссылка;
	
КонецФункции

Функция НайтиСоздатьУслугуПоНаименованию(Наименование, ВидСтавкиНДС)
	
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Наименование", Наименование);
	ДанныеЗаполнения.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Услуга);
	ДанныеЗаполнения.Вставить("ЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.шт);
	ДанныеЗаполнения.Вставить("КатегорияНоменклатуры", Справочники.КатегорииНоменклатуры.БезКатегории);
	Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Номенклатура, ДанныеЗаполнения);
	Номенклатура.Заполнить(ДанныеЗаполнения);
	Номенклатура.НаименованиеПолное = Номенклатура.Наименование;
	Номенклатура.СчетУчетаЗапасов = ПланыСчетов.Управленческий.СырьеИМатериалы;
	Номенклатура.СчетУчетаЗатрат = ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Номенклатура.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	Номенклатура.ВидСтавкиНДС = ВидСтавкиНДС;
	Номенклатура.Записать();
	Возврат Номенклатура.Ссылка;
	
КонецФункции

Процедура УстановитьИспользованиеРегламентногоЗадания(Использование)
	ИмяСобытия = НСтр("ru='ОбновлениеЗадания'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	УстановитьПривилегированныйРежим(Истина);
	Задание = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.ОбработкаСчетовНаОплатуСервиса);
	
	НадоСоздатьЗадание = Использование И Задание = Неопределено;
	Если НадоСоздатьЗадание Тогда
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("Использование", Истина);
		ПараметрыЗадания.Вставить("Расписание", РасписаниеРегламентногоЗадания());
		ПараметрыЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 10);
		ПараметрыЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 3);
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбработкаСчетовНаОплатуСервиса);
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
		Возврат;
	КонецЕсли;
	
	НадоИзменитьЗадание = Задание <> Неопределено И Задание.Использование <> Использование;
	Если Не НадоИзменитьЗадание Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Использование);
	РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
	
КонецПроцедуры

Функция РасписаниеРегламентногоЗадания()
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);
	
	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ДниНедели   = ДниНедели;
	Расписание.Месяцы      = Месяцы;
	Расписание.ПериодПовтораВТечениеДня = ?(ОбщегоНазначения.РежимОтладки(), 5, 180);
	Расписание.ПериодПовтораДней        = 1; // каждый день
	
	Возврат Расписание;
	
КонецФункции

Функция ДанныеКонтрагента(Контрагент)
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Контрагент),
		НСтр("ru='Не заполнено значение реквизита ""Контрагент""'"), НСтр("ru='метод ""ДанныеКонтрагента""'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.БанковскийСчетПоУмолчанию КАК БанковскийСчетПоУмолчанию,
	|	Контрагенты.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК БанковскийСчетПоУмолчаниюВалютаДенежныхСредств,
	|	Контрагенты.ВестиРасчетыПоДоговорам КАК ВестиРасчетыПоДоговорам
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	ДанныеКонтрагента = Запрос.Выполнить().Выбрать();
	ДанныеКонтрагента.Следующий();
	Возврат ДанныеКонтрагента;
	
КонецФункции

Функция ТекстСообщенийПользователю()
	
	МассивСообщений = Новый Массив;
	СообщенияПользователю = ПолучитьСообщенияПользователю();
	Для каждого СообщениеПользователю Из СообщенияПользователю Цикл
		МассивСообщений.Добавить(СообщениеПользователю.Текст);
	КонецЦикла;
	Возврат СтрСоединить(МассивСообщений, Символы.ПС);
	
КонецФункции

#КонецОбласти
